phase-4-rails-resources-index-show/app/controllers/birds_controller.rb

    def index
        birds = Bird.all
---
SELECT "birds".* FROM "birds"

    def show
        bird = Bird.find(params[:id])
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]