phase-4-mini-project-crud/app/controllers/spices_controller.rb

SELECT "spices".* FROM "spices"
---
    def index
        spice = Spice.all

INSERT INTO "spices" ("title", "image", "description", "notes", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        spice = Spice.create(spice_params)

DELETE FROM "spices" WHERE "spices"."id" = ?  [["id", 10]]
---
    def destroy
        spice = find_spice
        spice.destroy

SELECT "spices".* FROM "spices" WHERE "spices"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def find_spice
        Spice.find_by(id: params[:id])