phase-4-debugging-network-requests-lab/app/controllers/toys_controller.rb

  def index
    toys = Toy.all
---
SELECT "toys".* FROM "toys"

  def create
    toy = Toy.create(toy_params)
---
INSERT INTO "toys" ("name", "image", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    toy = find_toy
    toy.update(toy_params)
---
UPDATE "toys" SET "likes" = ?, "updated_at" = ? WHERE "toys"."id" = ?  [["likes", 5], ["updated_at", "2023-02-23 15:28:02.340366"], ["id", 4]]

  def destroy
    toy = find_toy
    toy.destroy
---
DELETE FROM "toys" WHERE "toys"."id" = ?  [["id", 2]]

  def find_toy
    Toy.find_by(id: params[:id])
---
SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]