phase-4-rails-routing-basics-readme/app/controllers/cheeses_controller.rb

SELECT "cheeses".* FROM "cheeses"
---
    def index
        cheeses = Cheese.all