phase-4-rails-routing-basics-lab/app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY "students"."grade" DESC
---
  def grades
    students = Student.order(grade: :desc)