phase-4-rails-create-read-lab/app/controllers/plants_controller.rb

SELECT "plants".* FROM "plants"
---
  def index
    plants = Plant.all

INSERT INTO "plants" ("name", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "FlatCoin"], ["image", "Shampoo"], ["price", 555.0], ["created_at", "2023-02-21 20:53:47.085160"], ["updated_at", "2023-02-21 20:53:47.085160"]]
---
  def create
    plant = Plant.create(plant_params)